In [90]:
#package 
import pandas as pd
import numpy as np

In [9]:
#input method to read file

# df=pd.read_csv("flee.txt")
# df.head()

In [55]:
#nested list dict

df = pd.DataFrame(data=([1,2,3,4], [3,4,5], [9,8,'7',1],[6,0]),
                  columns=["c1","c2","c3",'c4'])
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   3   4     5  NaN
2   9   8     7  1.0
3   6   0  None  NaN

In [56]:
df[['c1','c4']]

   c1   c4
0   1  4.0
1   3  NaN
2   9  1.0
3   6  NaN

In [57]:
df.loc[(2)]

c1    9
c2    8
c3    7
c4    1
Name: 2, dtype: object

In [58]:
df.loc[2,['c2']] # accessing by label

c2    8
Name: 2, dtype: object

In [59]:
df.iloc[:2:,:2:] #accessing by Index

   c1  c2
0   1   2
1   3   4

In [60]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   3   4     5  NaN
2   9   8     7  1.0
3   6   0  None  NaN

In [61]:
cond = df['c1'] >3
df[cond]

   c1  c2    c3   c4
2   9   8     7  1.0
3   6   0  None  NaN

In [62]:
df.where((df['c2']>3) & (df['c1']<5))

    c1   c2   c3  c4
0  NaN  NaN  NaN NaN
1  3.0  4.0    5 NaN
2  NaN  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [63]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   3   4     5  NaN
2   9   8     7  1.0
3   6   0  None  NaN

In [64]:
df.head(n=2)

   c1  c2 c3   c4
0   1   2  3  4.0
1   3   4  5  NaN

In [65]:
df.tail(n=2)

   c1  c2    c3   c4
2   9   8     7  1.0
3   6   0  None  NaN

In [66]:
df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [67]:
df['c3'].values

array([3, 5, '7', None], dtype=object)

In [68]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   3   4     5  NaN
2   9   8     7  1.0
3   6   0  None  NaN

In [24]:
df.sort_values(by = ['c1'], ascending=False)

   c1  c2    c3   c4
2   9   8     7  1.0
3   6   0  None  NaN
1   3   4     5  NaN
0   1   2     3  4.0

In [25]:
df['c5'] = (3,4,2,1)

In [40]:
df

   c1    c3   c4  c5
0   1     3  4.0   3
1   3     5  NaN   4
2   9     7  1.0   2
3   6  None  NaN   1

In [44]:
df.drop(['c2'], axis=1)

   c1    c3   c4
0   1     3  4.0
1   3     5  NaN
2   9     7  1.0
3   6  None  NaN

In [48]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   3   4     5  NaN
2   9   8     7  1.0
3   6   0  None  NaN

In [49]:
df.describe()

         c1       c2       c4
count  4.00  4.00000  2.00000
mean   4.75  3.50000  2.50000
std    3.50  3.41565  2.12132
min    1.00  0.00000  1.00000
25%    2.50  1.50000  1.75000
50%    4.50  3.00000  2.50000
75%    6.75  5.00000  3.25000
max    9.00  8.00000  4.00000

In [50]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   3   4     5  NaN
2   9   8     7  1.0
3   6   0  None  NaN

In [72]:
df.apply('mean', axis=0)

c1    4.75
c2    3.50
c4    2.50
dtype: float64

In [75]:
df.apply(lambda x:x*2)

   c1  c2   c3   c4
0   2   4    6  8.0
1   6   8   10  NaN
2  18  16   77  2.0
3  12   0  NaN  NaN

In [83]:
# looping through dataframe

for each in df.items():
    print(each)

('c1', 0    1
1    3
2    9
3    6
Name: c1, dtype: int64)
('c2', 0    2
1    4
2    8
3    0
Name: c2, dtype: int64)
('c3', 0       3
1       5
2       7
3    None
Name: c3, dtype: object)
('c4', 0    4.0
1    NaN
2    1.0
3    NaN
Name: c4, dtype: float64)

In [86]:
for each in df.iteritems():
    print(each)

('c1', 0    1
1    3
2    9
3    6
Name: c1, dtype: int64)
('c2', 0    2
1    4
2    8
3    0
Name: c2, dtype: int64)
('c3', 0       3
1       5
2       7
3    None
Name: c3, dtype: object)
('c4', 0    4.0
1    NaN
2    1.0
3    NaN
Name: c4, dtype: float64)

In [92]:
for each in df.iterrows():
    print(each)

(0, c1    1
c2    2
c3    3
c4    4
Name: 0, dtype: object)
(1, c1      3
c2      4
c3      5
c4    NaN
Name: 1, dtype: object)
(2, c1    9
c2    8
c3    7
c4    1
Name: 2, dtype: object)
(3, c1       6
c2       0
c3    None
c4     NaN
Name: 3, dtype: object)

In [100]:
for each in df.itertuples():
    print(each)

Pandas(Index=0, Team='Riders', Rank=1, Year=2014, Points=876)
Pandas(Index=1, Team='Riders', Rank=2, Year=2015, Points=789)
Pandas(Index=2, Team='Devils', Rank=2, Year=2014, Points=863)
Pandas(Index=3, Team='Devils', Rank=3, Year=2015, Points=673)
Pandas(Index=4, Team='Kings', Rank=3, Year=2014, Points=741)
Pandas(Index=5, Team='Kings', Rank=4, Year=2015, Points=812)
Pandas(Index=6, Team='Kings', Rank=1, Year=2016, Points=756)
Pandas(Index=7, Team='Kings', Rank=1, Year=2017, Points=788)
Pandas(Index=8, Team='Riders', Rank=2, Year=2016, Points=694)
Pandas(Index=9, Team='Royals', Rank=4, Year=2014, Points=701)
Pandas(Index=10, Team='Royals', Rank=1, Year=2015, Points=804)
Pandas(Index=11, Team='Riders', Rank=2, Year=2017, Points=690)

### groupby on DataFrame

In [112]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 
                     'Kings', 'Kings', 'Kings', 'Kings', 'Riders',
                     'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,
                     2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,
                      788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df.shape)
df

(12, 4)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

##### 
- Aggregation
- Transformation
- Filteration

In [115]:
df.groupby('Year').groups

{2014: Int64Index([0, 2, 4, 9], dtype='int64'),
 2015: Int64Index([1, 3, 5, 10], dtype='int64'),
 2016: Int64Index([6, 8], dtype='int64'),
 2017: Int64Index([7, 11], dtype='int64')}

In [116]:
df[df.Team == 'Devils']['Points'].mean()

768.0

In [117]:
df.groupby(['Team'])['Points'].mean()

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Points, dtype: float64

In [118]:
df.groupby(['Team'])['Points'].max()

Team
Devils    863
Kings     812
Riders    876
Royals    804
Name: Points, dtype: int64

In [120]:
df.groupby(['Team'])["Points"].mean() & (['Rank']).max()

AttributeError: 'list' object has no attribute 'max'

In [124]:
df["diff_point"] = df.groupby('Team')['Points'].transform(lambda x:x- np.mean(x))

In [128]:
df.head()

     Team  Rank  Year  Points  diff_point
0  Riders     1  2014     876      113.75
1  Riders     2  2015     789       26.75
2  Devils     2  2014     863       95.00
3  Devils     3  2015     673      -95.00
4   Kings     3  2014     741      -33.25

In [134]:
df.groupby('Team').filter(lambda x: len(x)>2)

      Team  Rank  Year  Points  diff_point
0   Riders     1  2014     876      113.75
1   Riders     2  2015     789       26.75
4    Kings     3  2014     741      -33.25
5    Kings     4  2015     812       37.75
6    Kings     1  2016     756      -18.25
7    Kings     1  2017     788       13.75
8   Riders     2  2016     694      -68.25
11  Riders     2  2017     690      -72.25